config/linked/doom/config.org
#+TITLE: My configuration
#+date: 2021-7-19
#+STARTUP: content
* Introduction
This is my literate configuration for doom emacs. I barley know [[https://learnxinyminutes.com/docs/elisp/][elisp]]  and I have
mostly stolen snippets from others. This config is [[elisp:(call-interactively #'count-words)][this many]] words, lines and
characters long. Its a lot of blood sweat and tears so I hope you like it as much
as I tolerate it!

#+begin_quote
Do note I don't try to explain how things work but I do try to explain my
motivation behind my config. I was told this is not the norm but this is my
config and =C-h f= exists so you can go have a look
#+end_quote

Lets get this config started!
#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;; Don't edit this file directly unless you like your changes being wiped
#+END_SRC

** Table of Contents :TOC_3:
- [[#introduction][Introduction]]
- [[#rudimentary-configuration][Rudimentary configuration]]
  - [[#keybinds][Keybinds]]
  - [[#hooky-hooks][Hooky hooks]]
  - [[#funky-functions][funky functions]]
  - [[#random-modes][Random modes]]
    - [[#type-break-mode][Type break mode]]
- [[#packages][Packages]]
  - [[#language-packages][Language packages]]
    - [[#caddy][Caddy]]
    - [[#vim][vim]]
    - [[#unit-tests][unit tests]]
    - [[#emacs-lisp-editions][Emacs lisp editions]]
    - [[#org-mode][org mode]]
  - [[#hugo-support][Hugo support]]
  - [[#modeline-fun][modeline fun]]
  - [[#evil-tutor][Evil tutor]]
  - [[#dired-drag-and-drop][dired drag and drop]]
  - [[#themes][themes]]
  - [[#discord-rich-presence][discord rich presence]]
  - [[#tldr-integration][tldr integration]]
  - [[#atomic-chrome][atomic chrome]]
  - [[#hacker-news][Hacker news]]
  - [[#emacs-webkit][emacs webkit]]
  - [[#pretty-code-shots][pretty code shots]]
  - [[#matrix][matrix]]
  - [[#keycast][keycast]]
  - [[#power-mode][Power mode]]
  - [[#selectric-mode][selectric-mode]]
  - [[#games][Games]]
  - [[#sidebars][Sidebars]]
    - [[#dired-sidebar][Dired sidebar]]
    - [[#ibuffer-sidebar][Ibuffer sidebar]]
    - [[#org-sidebar][Org Sidebar]]
  - [[#elfeed][elfeed]]
- [[#modules][Modules]]
  - [[#completion][completion]]
    - [[#company][company]]
    - [[#deprecated-ivy][DEPRECATED ivy]]
    - [[#vertico][vertico]]
  - [[#editor][editor]]
    - [[#evil][evil]]
  - [[#ui][ui]]
    - [[#doom][Doom]]
    - [[#doom-dashboard][Doom Dashboard]]
    - [[#modeline][Modeline]]
    - [[#treemacs][Treemacs]]
    - [[#workspaces][Workspaces]]
  - [[#tools][tools]]
    - [[#eval][eval]]
    - [[#lsp][lsp]]
    - [[#pdf][pdf]]
    - [[#tmux][tmux]]
  - [[#emacs][emacs]]
    - [[#dired][dired]]
  - [[#term][term]]
    - [[#eshell][eshell]]
  - [[#checkers][checkers]]
    - [[#spell][spell]]
  - [[#lang][lang]]
    - [[#org][Org]]
    - [[#deprecated-go][DEPRECATED Go]]
    - [[#haskell][haskell]]
    - [[#python][Python]]
    - [[#latex][LaTeX]]
    - [[#web][Web]]
  - [[#email][email]]
    - [[#mu4e][mu4e]]
  - [[#app][App]]
    - [[#irc][irc]]
    - [[#rss][rss]]
    - [[#everywhere][everywhere]]
- [[#epilogue][Epilogue]]

* Rudimentary configuration
This is the stuff that does not really belong in any module but is useful
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Jeetaditya Chatterjee"
      user-mail-address "jeetelongname@gmail.com" ;; god I can't wait to get away from gmail
      doom-scratch-initial-major-mode 'lisp-interaction-mode
      auth-sources '("~/.authinfo.gpg")
      ispell-dictionary "en"
      display-line-numbers-type 'relative ;; this is a reminder that I should try and use relative actions more
      browse-url-browser-function 'browse-url-firefox)

(when (boundp 'native-comp-async-jobs-number)
  (setq native-comp-async-jobs-number 9))
#+END_SRC

I like a little separation so I put an empty line at the top of my emacs
instance (I may put something in it later)
#+BEGIN_SRC emacs-lisp
(setq-default header-line-format
        (concat (propertize " " 'display '((space :align-to 0))) " "))
#+END_SRC

** Keybinds
These are my global keybinds they should not belong to any module. thus they
get stuck here
#+BEGIN_SRC emacs-lisp
(map!
 :n "z C-w" 'save-buffer ; I can use this onehanded which is nice when I need to leave or eat or something
 :leader
 :desc "Enable Coloured Values""t c" #'rainbow-mode
 :desc "Toggle Tabs""t B" #'centaur-tabs-local-mode
 :desc "Open Elfeed""o l" #'elfeed
 ;; I recompile more than I compile
 "cc" #'recompile
 "cC" #'compile)
#+end_src
** Hooky hooks
hl-line and rainbow mode don't play all too well so if one is on the other
should be off
#+begin_src emacs-lisp
(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
;; this snippet can be replaced with `(after! magit (setq magit-save-repository-buffers t))'
;; (after! magit (add-hook! 'magit-status-mode-hook :append (call-interactively #'save-some-buffers)))
#+end_src

#+BEGIN_SRC emacs-lisp
(remove-hook 'text-mode-hook #'visual-line-mode)
(add-hook 'text-mode-hook #'auto-fill-mode)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+END_SRC
** funky functions
Because this is a literate config I can't re evaluate the buffer using
~eval-buffer~ (bound to =SPC m e b=) so I reload the file after its tangled (usually
on save)
(=m e b= becomes =h r c=)
#+BEGIN_SRC emacs-lisp :tangle autoload.el
;;;###autoload
(defun yeet/reload ()
  "A simple cmd to make reloading my config easier"
  (interactive)
  (load! "config" doom-private-dir)
  (message "Reloaded!"))
#+END_SRC

#+begin_src emacs-lisp
(map! :leader
      "h r c" #'yeet/reload)
#+end_src
some how this function is run on startup? not that I am complaining
#+BEGIN_SRC emacs-lisp :tangle autoload.el
;;;###autoload
(defun henlo ()
  "henlo."
  (interactive)
  (message "henlo"))

(henlo) ;; oh wait thats how

#+END_SRC

I don't have a problem ok I can =M-x stop= at any time
#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun stop ()
  (interactive)
  (let ((name "*I can quit at any time*"))
    (switch-to-buffer (get-buffer-create name))
    (insert "I can stop at any time\nI am in control")))
#+end_src

thewe awe days whewe i nyeed to quickwy u-uwu a wawge a-amount of text w-wight in emacs
o-onwy wowks on an e-expwicit sewection a-at the moment [[https://github.com/Daniel-Liu-c0deb0t/uwu][this is the pwogwam i
use]] tho it couwd wowk with any uwu pwogwam t-that accepts s-stdin

#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun uwu (start end)
  "Uwu the text between START and END."
  (interactive "r")
  (let ((str (buffer-substring-no-properties start end)))
    (goto-char start)
    (delete-region start end)
    (insert (format "%s" (shell-command-to-string ;; I have to pipe the text into uwuify unless making a temp-file is more your style
                          (concat "echo "
                                  "'" str "'"
                                  " | " (executable-find "uwuify")))))))
#+end_src

This snippet toggles between a vertical and horizontal window. Like most things
I did not write this I took it from [[https://www.emacswiki.org/emacs/ToggleWindowSplit][here]]
#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      "w C-t" nil
      "w C-t" #'toggle-window-split)
#+end_src
** COMMENT macros
#+begin_src emacs-lisp
(defmacro add-many-to-lists (list-sym &rest lists)
     (dolist (elm (list ,@lists))
       (push elm ,list-sym)))
#+end_src

#+begin_src emacs-lisp

;; (let ((lst '(1 2)))
;;   (add-many-to-lists
;;    lst
;;    '(1 2 3)
;;    '(2 3 4)
;;    '(4 5 6)))
#+end_src

#+RESULTS:

** Random modes
*** TODO Type break mode
Type break reminds you too take a break once a certain threshold of keys has
been met. Its nice if its not too frequent
#+begin_src emacs-lisp
(use-package! type-break
  :defer
  :config
  (setq type-break-interval 1800 ;; half an hour between type breaks
        type-break-keystroke-threshold (cons 2000  14000))
  (type-break-mode 1))
#+end_src

* Packages
I have quite a few packages that I use. These are the packages and there
subsequent configurations
#+BEGIN_SRC emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+END_SRC
** Language packages :lang:
*** Caddy
Caddy is a webserver with its own file format
#+begin_src emacs-lisp :tangle packages.el
(package! caddyfile-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! caddyfile-mode
  :mode (("Caddyfile\\'" . caddyfile-mode)
         ("caddy\\.conf\\'" . caddyfile-mode)))
#+end_src
*** TODO vim
because sacrilege is fun
(this is mostly a mental exercise but it does work...) I can (alleged) also get lsp
support as well so this may be a fun project to take on
#+begin_src emacs-lisp :tangle packages.el
(package! vimrc-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! vimrc-mode
  :mode "\\.vim$\\'"
  :config)
;; (sp-local-pair 'vimrc-mode "\"" nil :actions :rem))
#+end_src
*** TODO unit tests
While I am in fact an incompetent programmer I do enjoy the sysiphisan task of
writing tests +thanks in no small part to the ease that cucumber makes it+
I was so ready to use it but it did not want too work with my ruby project :(

#+begin_src emacs-lisp :tangle packages.el
(package! feature-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! feature-mode
  :mode "\.feature$")
#+end_src
*** Emacs lisp editions :emacsLisp:
this adds a sybilance of a namespace in elisp
#+begin_src emacs-lisp :tangle packages.el
(package! nameless)
#+end_src

#+begin_src emacs-lisp
(use-package! nameless
  :defer t
  :config
  (add-hook 'emacs-lisp-mode-hook #'nameless-mode)
  (setq nameless-global-aliases '(("d" . "doom"))
        nameless-private-prefix t))
#+end_src
*** COMMENT Brainfuck

#+begin_src emacs-lisp :tangle packages.el
(package! brainfuck-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! brainfuck-mode
  :mode "\\.bf$\\'")
#+end_src
*** org mode :org:
#+begin_src emacs-lisp :tangle packages.el
(package! company-org-block)
#+end_src

#+begin_src emacs-lisp
(use-package! company-org-block
  :after org
  :config
  (setq company-org-block-edit-style 'auto))

(after! org
  (set-company-backend! 'org-mode-hook '(company-org-block company-capf))

  ;; (setq org-babel-load-languages
  ;;       '((elisp   . t)
  ;;         (python  . t)
  ;;         (ruby    . t)
  ;;         (haskell . t)
  ;;         (scheme  . t)
  ;;         (latex   . t)))
  )
#+end_src
** Hugo support
I blog! [[https://jeetelongname.github.io/blog][Sometimes.. When I can.. Not really]]
This is mostly just for the time stamp but it does come in handy
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! emacs-easy-hugo
  :recipe (:host github
           :repo "masasam/emacs-easy-hugo"
           :files ("*el")))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; (setq easy-hugo-basedir "~/code/git-repos/mine/jeetelongname.github.io/blog-hugo/")
(use-package! emacs-easy-hugo
  :after markdown
  :config
  (setq easy-hugo-root "~/code/git-repos/mine/jeetelongname.github.io/blog-hugo/"))
#+END_SRC
