config/linked/doom/packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! caddyfile-mode)

(package! vimrc-mode)

(package! feature-mode)

(package! nameless)

(package! brainfuck-mode)

(package! company-org-block)

(package! emacs-easy-hugo
  :recipe (:host github
           :repo "masasam/emacs-easy-hugo"
           :files ("*el")))
