config/linked/doom/config.org
** modeline fun :modeline:
/whats life without a little colour?/
#+begin_src emacs-lisp :tangle packages.el
(package! nyan-mode)
(package! parrot)
#+end_src

#+begin_src emacs-lisp
(defvar birds '(default confused emacs nyan rotating science thumbsup))

(use-package! nyan-mode
  :defer t
  :config
  (setq nyan-bar-length 15
        nyan-wavy-trail t))

(use-package! parrot
  :defer t
  :config
  (parrot-set-parrot-type (nth (random (length birds)) birds))) ;; this chooses a random bird on startup


(after! doom-modeline
  (nyan-mode)
  (nyan-start-animation)
  (parrot-mode)
  (parrot-start-animation))

;; (add-to-list 'marginalia-prompt-categories '("bird" . bird))

(defun bird-annotations (cand)
  "Takes a CANDidate (which is a bird) and returns a description of said bird"
  (let ((birds+annotations (-zip-pairs birds '("default bird is best bird"
                                          "they have got the spirit"
                                          "EMACS BIRD EMACS BIRD"
                                          "nananananan"
                                          "you spin me right round right round like a record baby"
                                          "science bitch!"
                                          "He is just happy to be here"))))
    (cdr (assoc cand birds+annotations))))

;; (add-to-list 'marginalia-annotator-registry '(bird bird-annotations))

#+end_src

#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun yeet/select-bird (bird)
  "Select BIRD from birds"
  (interactive (list (completing-read "Select bird: " birds)))
  (parrot-set-parrot-type bird))
#+end_src
** Evil tutor :evil:
I wanted to see the differences with its vim counterparts (its a litle nicer)
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! evil-tutor)
#+END_SRC
** dired drag and drop :dired:
I want drag and drop so I just wrapped dragon in elisp the drag commands work
wellish
#+begin_src emacs-lisp :tangle packages.el
;; (package! dired-dragon :recipe (:local-repo "~/code/elisp/dired-dragon"))
(package! dired-dragon :recipe (:host github :repo "jeetelongname/dired-dragon"))
#+end_src
#+begin_src emacs-lisp
(use-package! dired-dragon
  :after dired
  :config
  (map! :map dired-mode-map
        (:prefix "C-s"
         :n "d" #'dired-dragon
         :n "s" #'dired-dragon-stay
         :n "i" #'dired-dragon-individual)))
#+end_src

** themes :doom:
this was for a terminal  experiment that did not work
#+begin_src emacs-lisp :tangle packages.el
(package! horizon-theme)
(unpin! doom-themes)
(package! tao-theme)
#+end_src

** discord rich presence
Why use emacs when you can't tell everyone your using emacs?
I am now using elcord because.. peer pressure? I don't know but the config is
nice
#+begin_src emacs-lisp :tangle packages.el
(package! elcord)
#+end_src
I use non daemon sessions for testing I would much rather it would not be used
(and block the closing of emacs)

#+begin_src emacs-lisp
(when (daemonp)
  (use-package! elcord
    :config
    (quiet! (elcord-mode +1)))) ;; elcord is a noisy bitch. I don't need all of the output
#+end_src

#+RESULTS:
: t

** tldr integration
Ever wanted to.. not read a man page? me too. tldr is a good middle ground between
a lot of useless information and .. no information. Now in emacs!
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! tldr)
#+END_SRC

#+begin_src emacs-lisp
(use-package! tldr
  :config
  (setq tldr-directory-path (expand-file-name "tldr/" doom-etc-dir)) ;; don't be cluttering my work tree
  (setq tldr-enabled-categories '("common" "linux")))
#+end_src
** atomic chrome
#+begin_src emacs-lisp :tangle packages.el
(package! atomic-chrome)
#+end_src
When writing a lot of markdown on github this helps (now all I need to do is get the
button on a keybind in my browser)
#+begin_src emacs-lisp
(use-package! atomic-chrome
  :after-call focus-out-hook
  :config
  (setq atomic-chrome-buffer-open-style 'frame
        atomic-chrome-default-major-mode 'markdown-mode
        atomic-chrome-url-major-mode-alist
        '(("github.\\.com" . gfm-mode)
          ("reddit\\.com" . fundamental-mode)))

  (atomic-chrome-start-server))
#+end_src
** Hacker news
I am a hacker.. I like news (sometimes) Now in emacs!
#+begin_src emacs-lisp :tangle packages.el
(package! hackernews)
#+end_src

#+begin_src emacs-lisp
(use-package! hackernews :defer t)
#+end_src

** COMMENT DEPRECATED emacs application framework
#+begin_quote
EAF does not work with pgtk. due to reasons I don't understand [[https://github.com/manateelazycat/emacs-application-framework/issues/449][check out this
issue for more info]]
I will be moving to emacs webkit because /I need my emacs browser/
#+end_quote

eaf is an application framework for writing pyqt applications in emacs. Its
really cool!
https://github.com/MatthewZMD/.emacs.d#orgad36696 this is a config I need to revisit
You need a few dependencies for this to work. I don't recommend installing from
pip as it can be buggy

#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! eaf :recipe
  (:host github
   :repo "manateelazycat/emacs-application-framework"
   :files ("*")
   :build (:not compile)))

(package! epc)
(package! ctable)
(package! deferred)
#+END_SRC


#+BEGIN_SRC emacs-lisp
(use-package! eaf
  :defer t
  :init
  (use-package! epc :defer t)
  (use-package! ctable :defer t)
  (use-package! deferred :defer t)
  (use-package! s :defer t)
  :config
  (setq eaf-enable-debug t) ; should only be used when eaf is wigging out
  (eaf-setq eaf-browser-dark-mode "false") ; dark mode is overrated
  (setq eaf-browser-default-search-engine "duckduckgo")
  (eaf-setq eaf-browse-blank-page-url "https://duckduckgo.com"))

(use-package! eaf-evil ;; evil bindings in my browser
  :after eaf
  :config
  (setq eaf-evil-leader-keymap doom-leader-map)
  (setq eaf-evil-leader-key "spc"))
#+end_src

** TODO emacs webkit
because my emacs addiction is getting worse
#+begin_src emacs-lisp :tangle packages.el
(package! webkit :recipe
  (:host github :repo "akirakyle/emacs-webkit"
   :branch "main"
   :files (:defaults "*")))
#+end_src

** pretty code shots
i missed the ability to make pretty code shots inside vscode now its come back to
me through this package. its pretty cool and works well (it only does one thing)
#+begin_src emacs-lisp :tangle packages.el
(package! carbon-now-sh)
#+end_src

+i wanted to work with these code images directly in emacs so i brought in eaf to+
+help. do note that there is a bug in the pypi version of the qtwebengine that+
+basically segfaults if you open carbon (and probably other sites) if you install
from the repos tho this problem goes away+

I just went back to firefox since eaf is deprecated in my config
#+begin_src emacs-lisp
(use-package! carbon-now-sh
  :config
  (defun yeet/carbon-use-eaf ()
    (interactive)
    (split-window-right)
    (let ((browse-url-browser-function 'browse-url-firefox))
      (browse-url (concat carbon-now-sh-baseurl "?code="
                          (url-hexify-string (carbon-now-sh--region))))))
  (map! :n "g C-c" #'yeet/carbon-use-eaf))
#+end_src

#+begin_src emacs-lisp :tangle packages.el
;; (package! screenshot. :recipe
;;   (:host github :repo "tecosaur/screenshot"))
#+end_src

#+begin_src emacs-lisp
;; (use-package! screenshot :defer)
#+end_src
** TODO matrix
#+begin_src emacs-lisp :tangle packages.el
;; (package! matrix-client.el :recipe (:host github :repo "alphapapa/matrix-client.el"))
#+end_src

** TODO keycast
I have stolen this from @tecosaur again..
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! keycast)
#+END_SRC
it adds prettier keycast mode support and more stuff that I don't understand. I
also bound it
#+BEGIN_SRC emacs-lisp
(use-package! keycast
  :commands keycast-mode
  :after doom-modeline
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line."
    :global t
    (if keycast-mode
        (progn
          (add-hook 'pre-command-hook 'keycast-mode-line-update t)
          (add-to-list 'global-mode-string '("" mode-line-keycast " ")))
      (remove-hook 'pre-command-hook 'keycast-mode-line-update)
      (setq global-mode-string (remove '("" mode-line-keycast " ") global-mode-string))))
  (custom-set-faces!
    '(keycast-command :inherit doom-modeline-debug
                      :height 0.9)
    '(keycast-key :inherit custom-modified
                  :height 1.1
                  :weight bold))
  (map! :leader "tk" #'keycast-mode))
#+END_SRC
** Power mode
#+begin_src emacs-lisp :tangle packages.el
(package! power-mode :recipe (:host github :repo "elizagamedev/power-mode.el"))
#+end_src

#+begin_src emacs-lisp
(use-package! power-mode
  :defer t)

#+end_src

** selectric-mode
I want to annoy people with a loud keyboard without having to carry around a
loud keyboard
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! selectric-mode)
#+END_SRC
** Games
I want to make a module full of fun games and addition's to easter eggs. its there
to document what exists and just add a little more fun to the operating system
we call home
Some games I will probably add
 - https://web.archive.org/web/20070708044037/http://cedet.sourceforge.net/ftp/hangman.el-0.1.gz
 - https://www.emacswiki.org/emacs/CategoryGames
#+begin_src emacs-lisp :tangle packages.el
;; (package! emacs-2048
;;   :recipe (:host github
;;            :repo "sprang/emacs-2048"))

#+end_src
** Sidebars :sidebars:
By virtue of these things I seem to have 3 different sidebars (4 if you include
treemacs) that I have taken a liking to so they get there own sub genre

#+begin_src emacs-lisp
(defun yeet/sidebar-toggle ()
  "toggle both ibuffer and dired sidebars"
  (interactive)
  (ibuffer-sidebar-toggle-sidebar)
  (dired-sidebar-toggle-sidebar))

(map! :leader "o p" nil
      :leader "o p" #'dired-sidebar-toggle-sidebar ;; this is more useful most of the time
      :leader "o P" #'yeet/sidebar-toggle) ;; this is when I need too do some buffer management
#+end_src

*** Dired sidebar
this is a replacement for treemacs. Now don't get me wrong. I like treemacs. Its
great but its /not dired/. This preserves a lot of the dired configuration I could
do and more importantly preserves keys which is nice
#+begin_src emacs-lisp :tangle packages.el
(package! dired-sidebar)
#+end_src

#+begin_src emacs-lisp
;; (after! dired-sidebar (add-hook! 'dired-sidebar-mode-hook (doom-modeline-mode -1)))

(use-package! dired-sidebar
  :defer t
  :commands dired-sidebar-toggle-sidebar
  :config
  (setq dired-sidebar-use-custom-modeline t
        dired-sidebar-should-follow-file t))
#+end_src

*** Ibuffer sidebar
this is the same thing as above made by the same [[https://github.com/jojojames][author]] and it works just like
dired sidebar.. for Ibuffer
#+begin_src emacs-lisp :tangle packages.el
(package! ibuffer-sidebar)
#+end_src

#+begin_src emacs-lisp
(use-package! ibuffer-sidebar
  :commands ibuffer-sidebar-toggle-sidebar
  :defer t)
#+end_src
*** TODO Org Sidebar
this does a bunch of org stuff like break stuff down into headings. there is a
bit of work to be done
#+begin_src emacs-lisp :tangle packages.el
(package! org-sidebar)
#+end_src


#+begin_src emacs-lisp
(use-package! org-sidebar
  :after org)
#+end_src

** COMMENT affe :completion:vertico:
affe adds async fuzzy finding. I need to work on it some more
#+begin_src emacs-lisp :tangle packages.el
(package! affe)
#+end_src

#+begin_src emacs-lisp
(use-package! affe
  :after orderless
  :config
  ;; Configure Orderless
  (setq affe-regexp-function #'orderless-pattern-compiler
        affe-highlight-function #'orderless-highlight-matches))
#+end_src
** elfeed :app:rss:
I needed elfeed to look a little nicer. so I got elfeed goodies which did the job
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! elfeed-goodies)
(package! elfeed-web)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package! elfeed-goodies
  :after elfeed
  :config
  (setq elfeed-goodies/powerline-default-separator 'bar)
  (elfeed-goodies/setup))
#+END_SRC
* Modules
These are the configurations for the doom specific modules. some are big like
mu4e, some are small like dired. some are well sized. They are all loved tho!
(except the deprecated ones.)
** completion :completion:
*** company :company:
Deals with completions something I like. I elect for manual completion but
defer the idle delay for those real brain fart seconds
#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-idle-delay 6 ; I like my autocomplete like my tea. Mostly made by me but appreciated when someone else makes it for me
        ;; company-minimum-prefix-length 2
        company-show-numbers t))
#+END_SRC
*** DEPRECATED ivy :ivy:
Ivy is nice but +selectrum+ vertico is my friend
#+BEGIN_SRC emacs-lisp
(after! ivy
  (setq ivy-height 20
        ivy-wrap nil
        ivy-magic-slash-non-match-action t)
  (add-to-list 'ivy-re-builders-alist '(counsel-projectile-find-file . ivy--regex-plus)))
#+END_SRC

this is to make prescient a little more intelligent
#+BEGIN_SRC emacs-lisp
(setq-default history-length 10000)
(setq-default prescient-history-length 10000)
#+END_SRC
*** vertico :vertico:
