config/linked/doom/config.org
**** TODO org super agenda
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! origami)
(package! org-super-agenda)
#+END_SRC

#+begin_src emacs-lisp
(use-package! org-super-agenda
  :defer t
  :config
  (setq org-super-agenda-groups
         '(;; Each group has an implicit boolean OR operator between its selectors.
           (:name "Today"  ; Optionally specify section name
            :time-grid t  ; Items that appear on the time grid
            :todo "TODO")  ; Items that have this TODO keyword
           (:name "Important"
            ;; Single arguments given alon
            :tag "bills"
            :priority "A")
           ;; Groups supply their own section names when none are given
           (:todo "WAITING" :order 8)  ; Set order of this section
           (:todo ("SOMEDAY" "TO-READ" "CHECK" "TO-WATCH" "WATCHING")
            ;; Show this group at the end of the agenda (since it has the
            ;; highest number). If you specified this group last, items
            ;; with these todo keywords that e.g. have priority A would be
            ;; displayed in that group instead, because items are grouped
            ;; out in the order the groups are listed.
            :order 9    )
           (:priority<= "B"
            ;; Show this section after "Today" and "Important", becaus  e
            ;; their order is unspecified, defaulting to 0. Sections
            ;; are displayed lowest-number-first.
            :order 1))
         org-agenda-start-day "0d"
         org-agenda-span 1))

#+end_src

*** DEPRECATED Go :go:
I have not written much go (at all)
Go and lsp have not been behaving like they should. the file watchers have been
misbehaving and now they have been disabled for go mode. That fixes the issue
but means lsp will not watch files in the workspace (a small price to pay imo)
#+BEGIN_SRC emacs-lisp
(after! go-mode ;; I have stopped using ligatures so this is not useful to me but it can be to you!
  (when (featurep! :ui ligatures)
    (set-ligatures! 'go-mode
                    :def "func"
                    :true "true" :false "false"
                    :int "int" :str "string"
                    :float "float" :bool "bool"
                    :for "for"
                    :return "return" )))

(setq-hook! 'go-mode-hook
  lsp-enable-file-watchers nil)
#+END_SRC

*** haskell
I have been pretty lazy when it comes to learning haskell
#+begin_src emacs-lisp
(after! lsp-haskell
  (setq lsp-haskell-formatting-provider "ormolu"))
#+end_src

*** Python :python:
Python is great is it not 🐍
#+BEGIN_SRC emacs-lisp
(setq! +python-ipython-command '("ipython3" "-i" "--simple-prompt" "--no-color-info"))
(set-repl-handler! 'python-mode #'+python/open-ipython-repl)
#+END_SRC

*** LaTeX :LaTeX:
#+BEGIN_SRC emacs-lisp
(setq +latex-viewers '(pdf-tools zathura)) ;; don't be going to those filthy third party apps
#+END_SRC

#+BEGIN_SRC emacs-lisp
(map! :map cdlatex-mode-map
      :i "TAB" #'cdlatex-tab)
#+END_SRC

*** Web :web:
I just find the tidy formatter indent functionality annoying and redundant. so
I changed it
#+begin_src emacs-lisp
(setenv "HTML_TIDY" (expand-file-name "tidy.conf" doom-private-dir))
(setq +format-on-save-enabled-modes
      '(not web-mode))
#+end_src

Why leave emacs too compile sass?  TODO take an input and output dir
#+begin_src emacs-lisp :tangle autoload.el
(defun yeet/scss-compile (watch)
  "Get sass compiling my scss files."
  (start-process-shell-command
   "sass-compile" "*sass-compile-log*"
   (concat "sass "
           (if watch "--watch " " ")
           (concat (projectile-acquire-root) "css/scss") ":"
           (concat (projectile-acquire-root) "css" )
           " --no-color")))

;;;###autoload
(defun yeet/scss-build ()
  "Build Scss files in directory."
  (interactive)
  (yeet/scss-compile nil)
  (message "SCSS Compiled!"))

;;;###autoload
(defun yeet/scss-start ()
  "Watch Scss file in directory."
  (interactive)
  (yeet/scss-compile t))

;;;###autoload
(defun yeet/scss-stop ()
  "Kill any current scss processes"
  (interactive)
  (delete-process "sass-compile")
  (message "Sass process killed"))

#+end_src

#+RESULTS:
: yeet/scss-stop

#+begin_src emacs-lisp
(map! (:map 'scss-mode-map
       :localleader
       "b" nil
       (:prefix ("s" . "sass")
        "b" #'yeet/scss-build
        "c" #'yeet/scss-start
        "C" #'yeet/scss-stop)))
#+end_src
TODO caddy integration
**** css
I use sass and sadly the css-ls does not really work that well. I am going to
stick with the lsp less life for css
#+begin_src emacs-lisp
(remove-hook! '(css-mode-local-vars-hook
                scss-mode-local-vars-hook
                sass-mode-local-vars-hook
                less-css-mode-local-vars-hook)
  #'lsp!)
#+end_src
** email :email:
*** mu4e :mu4e:
Whats better than email? email in emacs! mu4e has been fine for me so I dont
think I will be switching to notmuch or what notj

Setting my email using ~set-email-acount~. its a simple affair If you are stuck
on the folders remember that they come from what you set in your [[https://github.com/jeetelongname/dotfiles/blob/master/mail/.mbsyncrc#L31][mail fetcher config]]
#+BEGIN_SRC emacs-lisp
(set-email-account! "gmail"
                    '((mu4e-sent-folder       . "/gmail/\[Gmail\]/Sent Mail")
                      (mu4e-drafts-folder     . "/gmail/\[Gmail\]/Drafts")
                      (mu4e-trash-folder      . "/gmail/\[Gmail\]/Trash")
                      (mu4e-refile-folder     . "/gmail/\[Gmail\]/All Mail")
                      (smtpmail-smtp-user     . "jeetelongname@gmail.com"))t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(after! mu4e
  (setq smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 25))
#+END_SRC

I use msmtp to send my mail as its a little faster and has room for expansion
#+begin_src emacs-lisp
(setq sendmail-program (executable-find "msmtp")
      send-mail-function #'smtpmail-send-it
      message-sendmail-f-is-evil t
      message-sendmail-extra-arguments '("--read-envelope-from")
      message-send-mail-function #'message-send-mail-with-sendmail)
#+end_src

Adding some keybinding under local-leader. this should make it a little easier to
do mail stuff. I do like =C-c C-c= to send tho
#+begin_src emacs-lisp
(map! (:map org-msg-edit-mode-map
       :n "<tab>" #'org-msg-tab
       :localleader
       (:prefix "m"
        "k" #'org-msg-edit-kill-buffer
        "s" #'message-goto-subject
        "b" #'org-msg-goto-body
        "a" #'org-msg-attach)))
#+end_src

These are the settings for org-msg I may switch them to a snippet tho as I can
toggle the kind of signature I want to use then
#+BEGIN_SRC emacs-lisp
(after! mu4e
  (setq
   ;; org-msg-default-alternatives '(html)
   org-msg-greeting-fmt "\nHi *%s*,\n\n"
   org-msg-signature "\nRegards,
 ,#+begin_signature
 -- *Jeetaditya Chatterjee* \\\\
 /Sent using my text editor/
 ,#+end_signature"))
#+END_SRC

I don't like the default replied face
#+begin_src emacs-lisp
(custom-set-faces! `(mu4e-replied-face :foreground ,(doom-color 'red) :inherit font-lock-builtin-face))
#+end_src

I update my mail when I feel like it so this is a little redundant for me
#+begin_src emacs-lisp :tangle packages.el
(package! mu4e-alert :disable t)
#+end_src
** App :app:
*** irc :irc:
I have a beard and I do like wasting time...
#+begin_src emacs-lisp
(after! circe
  (set-irc-server! "irc.eu.libera.chat"
                   '(:tls t
                     :port 6697
                     :nick "jeetelongname"
                     :sasl-username ,"jeetelongname"
                     :sasl-password (+pass-get-secret "social/freenode")
                     :channels ("#emacs" "#haskell"))))
#+end_src
*** rss :rss:
Elfeed is great. I just need more blogs
#+BEGIN_SRC emacs-lisp
(after! elfeed
  (setq elfeed-search-filter "@3-week-ago -fun") ;; /they post so much/

  (setq rmh-elfeed-org-files (list (concat org-directory "elfeed.org"))) ;; +org
  (add-hook! 'elfeed-search-mode-hook 'elfeed-update)) ; update on entry
#+END_SRC

There have been times where I wanted to share a link to an interesting blog or a
comic that made me laugh. this just automated that process
#+begin_src emacs-lisp :tangle autoload.el
;;;###autoload
(defun yeet/elfeed-copy-link ()
  "Copy current link to clipboard for easy sharing"
  (interactive)
  (let ((link (elfeed-entry-link elfeed-show-entry)))
    (when link
      (kill-new link)
      (message "Copied %s to clipboard" link))))

;; not actually useful as you can just use =title to filter by title
;;;###autoload
(defun yeet/search-feeds-by-title (feed-title)
  (interactive (list (completing-read "Select Feed" (let (feed-titles)
                                                (dolist (feed elfeed-feeds feed-titles)
                                                  (push (cons (elfeed-feed-title (elfeed-entry-feed (car (elfeed-feed-entries (car feed)))))
                                                              (car feed))
                                                        feed-titles))))))
  (message "%s"  feed-title))

#+end_src

#+begin_src emacs-lisp
(map! (:map elfeed-show-mode-map
       :n "gc" nil
       :n "gc" #'yeet/elfeed-copy-link))
#+end_src

*** everywhere :everywhere:
I prefer to write in the language that is going to be posted so markdown mode
makes more sense to be the default (which is org)
#+begin_src emacs-lisp
(after! emacs-everywhere
  (add-hook! 'emacs-everywhere-init-hooks 'markdown-mode)
  (remove-hook! 'emacs-everywhere-init-hooks 'org-mode))
#+end_src

* Epilogue
And that was my config! I hope you liked it! If you did not then you can make an
[[https://github.com/jeetelongname/.doom/issues][issue]] and if you just want to say I suck then i guess you can use that for that
too. I guess this is it for me... I am going back to bed
