config/emacs/doom/packages.el

(package! mu4e-alert :disable t)
